//--------------------------------------------------------------------------------------------------

require('app.init')(
    ['Colors'],
    [
        './Modules/Socket/Socket.js',
        './Modules/Socket/SocketClient.js',
        './Modules/Socket/SocketConnect.js',
        './Modules/Socket/SocketConsole.js',
        './Modules/Socket/SocketCuts.js'
    ]
);

/*--------------------------------------------------------------------------------------------------
|
| -> Создаем сервер
|
|-------------------------------------------------------------------------------------------------*/

$.Socket.create({
/* Консоль
 * -> all = все запросы
 * -> body = только тело запросов
**/
    console: 'body',
    
// Адрес сервера
    host: ['192.168.1.2', '8081'],
    
// Обработчик авторизации
    onAccess: function(onError, onComplete, userid, password) {
    // Пример асинхронного запроса к базе данных
        setTimeout(function() {
        // Ошибка авторизации
            //return onError();
            
        // Успешная авторизация
            return onComplete(userid, {
                userid: userid,
                password: password
            });
        }, 1000);
    }
});

/*--------------------------------------------------------------------------------------------------
|
| -> Добавляем обработчик инициализации
|
|-------------------------------------------------------------------------------------------------*/

$.on('Init', function(id) {
// Пример асинхронного запроса к базе данных
    setTimeout(() => {
    // Сообщение в консоли
        _= 'Init, id: ' + id;
        
    // Вызываем обработчик инициализации
        this.send('Init', 123);
    }, 1000);
});

/*--------------------------------------------------------------------------------------------------
|
| -> Добавляем обработчик GetName
|
|-------------------------------------------------------------------------------------------------*/

$.on('getName', function(id, name) {
    _= 'ID: ' + id;
    _= 'name: ' + name;
    _= 'this.getUserID(): ' + this.getUserID();
    this.send('setName', 1, 2, 3);
});

//--------------------------------------------------------------------------------------------------