/*--------------------------------------------------------------------------------------------------
|
| -> Сокращенный вариант добавления нового обработчика
|
|-------------------------------------------------------------------------------------------------*/

$.on = function(event, callback) {
    $.Socket.on(event, callback);
};

/*--------------------------------------------------------------------------------------------------
|
| -> Отправляет сообщение об ошибке и закрывает соединение
|
|-------------------------------------------------------------------------------------------------*/

$.error = function(userid, error_msg) {
    for (var id in $.SocketConnect.getUser(userid)) {
        $.SocketConnect.getConnect(id).error(error_msg);
    }
};

/*--------------------------------------------------------------------------------------------------
|
| -> Отправляет сообщение
|
|-------------------------------------------------------------------------------------------------*/

$.send = function(userid, event, msg) {
    for (var id in $.SocketConnect.getUser(userid)) {
        $.SocketConnect.getConnect(id).send(event, msg);
    }
};

/*--------------------------------------------------------------------------------------------------
|
| -> Закрывает соединение
|
|-------------------------------------------------------------------------------------------------*/

$.close = function(userid) {
    for (var id in $.SocketConnect.getUser(userid)) {
        $.SocketConnect.getConnect(id).close();
    }
};

//--------------------------------------------------------------------------------------------------