//--------------------------------------------------------------------------------------------------

require('app.init')(
    './Modules'
);

/*--------------------------------------------------------------------------------------------------
|
| -> Создаем сервер
|
|-------------------------------------------------------------------------------------------------*/

$.Socket.create({
/* Консоль
 * -> all = все запросы
 * -> body = только тело запросов
**/
    console: 'body',
    
// Адрес сервера
    host: [process.env.IP, process.env.PORT],
    
// Обработчик авторизации
    onAccess: function(userid, password) {
    // Задаем UserID
        this.setUserID(userid);
        
    // Задаем информацию о юзере
        this.setData({
            userid: userid,
            password: password
        });
    },
    
// Обработчик инициализации
    onInit: function(success) {
        return {
            userid: this.getUserID(),
            name: 'Вася'
        };
    }
});

/*--------------------------------------------------------------------------------------------------
|
| -> Добавляем обработчик GetName
|
|-------------------------------------------------------------------------------------------------*/
/*
$.on('getName', function(success) {
    console.log('success[id]: ' + success['id']);
    console.log('this.getUserID(): ' + this.getUserID());
});
*/
//--------------------------------------------------------------------------------------------------