//--------------------------------------------------------------------------------------------------

require('app.init')(
    './Modules'
);

/*--------------------------------------------------------------------------------------------------
|
| -> Создаем сервер
|
|-------------------------------------------------------------------------------------------------*/

$.Socket.create({
/* Консоль
 * -> all = все запросы
 * -> body = только тело запросов
**/
    console: 'body',
    
// Адрес сервера
    host: [process.env.IP, process.env.PORT],
    
// Обработчик авторизации
    onAccess: function(userid, password) {
    // Задаем UserID
        this.setUserID(userid);
        
    // Задаем информацию о юзере
        this.setData({
            userid: userid,
            password: password
        });
    },
    
// Обработчик инициализации
    onInit: function(id) {
        console.log('onInit: ' + id);
        return [this.getUserID(), 'Вася'];
    }
});

/*--------------------------------------------------------------------------------------------------
|
| -> Добавляем обработчик GetName
|
|-------------------------------------------------------------------------------------------------*/

$.on('getName', function(id, name) {
    console.log('ID: ' + id);
    console.log('name: ' + name);
    console.log('this.getUserID(): ' + this.getUserID());
    this.send('setName', 1, 2, 3);
});

//--------------------------------------------------------------------------------------------------